Infineon/micropython-psoc-edge/ports/psoc-edge/machine_uart.c
    machine_uart_obj_t *self = NULL;
    mp_map_t kw_args;
    mp_map_init_fixed_table(&kw_args, n_kw, args + n_args);
    machine_uart_init_impl(&self, uart_id, init_n_args, init_args, &kw_args);
    return MP_OBJ_FROM_PTR(self);
}

static void mp_machine_uart_deinit(machine_uart_obj_t *self) {
    machine_uart_hw_deinit(self);
    m_del(uint8_t, self->rx_ringbuf.buf, self->rx_ringbuf.size);
    pclk_div_slave_deinit(self->scb_obj->clk, self->scb_obj->slave_nr);
    machine_scb_obj_free(self->scb_obj);
    mp_machine_uart_obj_free(self);
}

static void mp_machine_uart_init_helper(machine_uart_obj_t *self, size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    machine_uart_init_impl(&self, self->id, n_args, pos_args, kw_args);
}

static mp_int_t mp_machine_uart_any(machine_uart_obj_t *self) {
    return ringbuf_avail(&self->rx_ringbuf);
}

static bool mp_machine_uart_txdone(machine_uart_obj_t *self) {
    return Cy_SCB_UART_IsTxComplete(self->scb_obj->scb);
}

#if MICROPY_PY_MACHINE_UART_SENDBREAK
static void mp_machine_uart_sendbreak(machine_uart_obj_t *self) {
    Cy_SCB_UART_SendBreakBlocking(self->scb_obj->scb, machine_uart_break_width(self));
}
#endif

#if MICROPY_PY_MACHINE_UART_READCHAR_WRITECHAR
static mp_int_t mp_machine_uart_readchar(machine_uart_obj_t *self) {
    if (machine_uart_rx_wait(self, self->timeout_ms)) {
        return (uint8_t)ringbuf_get(&self->rx_ringbuf);
    }

    return MP_STREAM_ERROR;
}

static void mp_machine_uart_writechar(machine_uart_obj_t *self, uint16_t data) {
    if (machine_uart_tx_wait(self, self->timeout_ms)) {
        Cy_SCB_UART_Put(self->scb_obj->scb, (uint32_t)data);
    } else {
        mp_raise_OSError(MP_ETIMEDOUT);
    }
}
#endif

static mp_uint_t mp_machine_uart_read(mp_obj_t self_in, void *buf_in, mp_uint_t size, int *errcode) {
    machine_uart_obj_t *self = MP_OBJ_TO_PTR(self_in);

    if (size == 0) {
        return 0;
    }

    /* wait for first char to become available */
    if (!machine_uart_rx_wait(self, self->timeout_ms)) {
        /* return EAGAIN error to indicate non-blocking (then read() method returns None) */
        *errcode = MP_EAGAIN;
        return MP_STREAM_ERROR;
    }

    uint32_t read_count = 0;
    uint32_t to_read;
    do {
        to_read = (size < ringbuf_avail(&self->rx_ringbuf)) ? size : ringbuf_avail(&self->rx_ringbuf);
        ringbuf_memcpy_get_internal(&self->rx_ringbuf, (uint8_t *)buf_in + read_count, to_read);
        read_count += to_read;
        size -= to_read;
    } while (size > 0 && machine_uart_rx_wait(self, self->timeout_char_ms));

    return read_count;
}

static mp_uint_t mp_machine_uart_write(mp_obj_t self_in, const void *buf_in, mp_uint_t size, int *errcode) {
    machine_uart_obj_t *self = MP_OBJ_TO_PTR(self_in);

    /* wait to be able to write the first character. */
    if (!machine_uart_tx_wait(self, self->timeout_ms)) {
        /* EAGAIN causes write to return None */
        *errcode = MP_EAGAIN;
        return MP_STREAM_ERROR;
    }

    uint32_t write_count = 0;
    do {
        uint32_t written = Cy_SCB_UART_PutArray(self->scb_obj->scb, (void *)buf_in, size);
        buf_in = (const uint8_t *)buf_in + written;
        size -= written;
        write_count += written;
    } while (size > 0 && machine_uart_tx_wait(self, self->timeout_char_ms));

    return write_count;
}

static mp_uint_t mp_machine_uart_ioctl(mp_obj_t self_in, mp_uint_t request, uintptr_t arg, int *errcode) {
    machine_uart_obj_t *self = MP_OBJ_TO_PTR(self_in);
    mp_uint_t ret;
    if (request == MP_STREAM_POLL) {
        uintptr_t flags = arg;
        ret = 0;
        if ((flags & MP_STREAM_POLL_RD) && ringbuf_avail(&self->rx_ringbuf) > 0) {
            ret |= MP_STREAM_POLL_RD;
        }
        if ((flags & MP_STREAM_POLL_WR) && (Cy_SCB_UART_GetTxFifoStatus(self->scb_obj->scb) & CY_SCB_UART_TX_NOT_FULL)) {
            ret |= MP_STREAM_POLL_WR;
        }
    } else if (request == MP_STREAM_FLUSH) {
        /**
         * Estimate the time required to shift out all remaining bytes from the TX hardware pipeline.
         * Cy_SCB_UART_GetNumInTxFifo() returns the exact byte count in the TX FIFO but explicitly
         * excludes the TX shifter register (1 byte). Adding 1 accounts for that shifter. The sum is
         * multiplied by 13 bits per symbol (1 start + 8 data + 2 stop, 1 parity), and multiplied by 2
         * (for safety margin) and divided by the baudrate to get the duration in milliseconds.
         * uint32_t is sufficient: max FIFO is < 256 bytes, so the worst-case duration is well within
         * the uint32_t range even at the lowest supported baud rates.
         */
        uint32_t timeout = mp_hal_ticks_ms() + (1
            + Cy_SCB_UART_GetNumInTxFifo(self->scb_obj->scb)
            ) * 13000 * 2 / self->baudrate;
        do {
            if (mp_machine_uart_txdone(self)) {
                return 0;
            }
            mp_event_handle_nowait();
        } while (mp_hal_ticks_ms() < timeout);
        *errcode = MP_ETIMEDOUT;
        ret = MP_STREAM_ERROR;
    } else {
        *errcode = MP_EINVAL;
        ret = MP_STREAM_ERROR;
    }
    return ret;
}

void machine_uart_deinit_all() {
    for (uint8_t i = 0; i < MICROPY_PY_MACHINE_UART_NUM_ENTRIES; i++) {
        machine_uart_obj_t *self = MP_STATE_PORT(machine_uart_obj[i]);
        if (self != NULL) {
            mp_machine_uart_deinit(self);
        }
    }
}

#if MICROPY_PY_MACHINE_UART_IRQ

#define MP_UART_ALLOWED_FLAGS (CY_SCB_RX_INTR_NOT_EMPTY | \
    CY_SCB_RX_INTR_UART_BREAK_DETECT | \
    CY_SCB_TX_INTR_UART_DONE)

static void machine_uart_irq_rx_idle(machine_uart_obj_t *self) {
    /**
     * Use CY_SCB_RX_INTR_NOT_EMPTY as RX_IDLE combined with
     * checking if the RX FIFO is empty. Therefore this function
     * will be called after reading all the data in the
     * RX FIFO.
     */
    if ((self->mp_irq_obj != NULL) &&
        (self->mp_irq_obj->handler != NULL) &&
        (self->mp_irq_trigger & CY_SCB_RX_INTR_NOT_EMPTY) &&
        (Cy_SCB_UART_GetNumInRxFifo(self->scb_obj->scb) == 0)) {
        self->mp_irq_flags |= CY_SCB_RX_INTR_NOT_EMPTY;
        mp_irq_handler(self->mp_irq_obj);
    }
}

static void machine_uart_irq_rx_break(machine_uart_obj_t *self) {
    if ((self->mp_irq_obj != NULL) &&
        (self->mp_irq_obj->handler != NULL) &&
        (self->mp_irq_trigger & CY_SCB_RX_INTR_UART_BREAK_DETECT)) {
        self->mp_irq_flags |= CY_SCB_RX_INTR_UART_BREAK_DETECT;
        mp_irq_handler(self->mp_irq_obj);
    }
}

static void machine_uart_irq_tx_idle(machine_uart_obj_t *self) {
    if ((self->mp_irq_obj != NULL) &&
        (self->mp_irq_obj->handler != NULL) &&
        (self->mp_irq_trigger & CY_SCB_TX_INTR_UART_DONE)) {
        self->mp_irq_flags |= CY_SCB_TX_INTR_UART_DONE;
        mp_irq_handler(self->mp_irq_obj);
    }
}

